results/gin_results.txt
Running 30s test @ http://localhost:8000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.92ms    3.21ms  66.99ms   86.43%
    Req/Sec     5.37k     0.96k    7.34k    71.25%
  641408 requests in 30.02s, 83.19MB read
Requests/sec:  21367.84
Transfer/sec:      2.77MB