results/golang_beego_results.txt
Running 30s test @ http://localhost:8000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.55ms    2.95ms  47.47ms   83.72%
    Req/Sec     5.83k     0.98k    7.97k    67.67%
  696533 requests in 30.02s, 89.68MB read
Requests/sec:  23204.74
Transfer/sec:      2.99MB