results/golang_echo_results.txt
Running 30s test @ http://localhost:8000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.37ms    3.49ms  97.46ms   93.55%
    Req/Sec     6.20k     1.19k    8.96k    71.67%
  741183 requests in 30.02s, 85.53MB read
Requests/sec:  24686.19
Transfer/sec:      2.85MB