results/python_bottle_results.txt
Running 30s test @ http://localhost:8000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.96ms  155.75ms   1.87s    95.89%
    Req/Sec   314.30    205.14     1.11k    66.47%
  16364 requests in 30.10s, 2.81MB read
  Socket errors: connect 0, read 0, write 0, timeout 104
Requests/sec:    543.72
Transfer/sec:     95.58KB