results/python_flask_results.txt
Running 30s test @ http://localhost:8000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   120.29ms   17.73ms 253.86ms   91.65%
    Req/Sec   207.64     50.49   252.00     85.88%
  16373 requests in 30.08s, 3.06MB read
  Socket errors: connect 99, read 0, write 0, timeout 0
Requests/sec:    544.27
Transfer/sec:    104.18KB